zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/kdf_reg.h
#define KDF_CTL_START_Pos                (0)                                               /*!< KDF_T::CTL: START Position             */
#define KDF_CTL_START_Msk                (0x1ul << KDF_CTL_START_Pos)                      /*!< KDF_T::CTL: START Mask                 */

#define KDF_CTL_NEXT_Pos                 (1)                                               /*!< KDF_T::CTL: NEXT Position              */
#define KDF_CTL_NEXT_Msk                 (0x1ul << KDF_CTL_NEXT_Pos)                       /*!< KDF_T::CTL: NEXT Mask                  */

#define KDF_CTL_FINISH_Pos               (2)                                               /*!< KDF_T::CTL: FINISH Position            */
#define KDF_CTL_FINISH_Msk               (0x1ul << KDF_CTL_FINISH_Pos)                     /*!< KDF_T::CTL: FINISH Mask                */

#define KDF_CTL_MODE_Pos                 (4)                                               /*!< KDF_T::CTL: MODE Position              */
#define KDF_CTL_MODE_Msk                 (0x1ul << KDF_CTL_MODE_Pos)                       /*!< KDF_T::CTL: MODE Mask                  */

#define KDF_CTL_KEYINSEL_Pos             (8)                                               /*!< KDF_T::CTL: KEYINSEL Position          */
#define KDF_CTL_KEYINSEL_Msk             (0x3ul << KDF_CTL_KEYINSEL_Pos)                   /*!< KDF_T::CTL: KEYINSEL Mask              */

#define KDF_CTL_SALTSEL_Pos              (10)                                              /*!< KDF_T::CTL: SALTSEL Position           */
#define KDF_CTL_SALTSEL_Msk              (0x1ul << KDF_CTL_SALTSEL_Pos)                    /*!< KDF_T::CTL: SALTSEL Mask               */

#define KDF_CTL_LBSEL_Pos                (11)                                              /*!< KDF_T::CTL: LBSEL Position             */
#define KDF_CTL_LBSEL_Msk                (0x1ul << KDF_CTL_LBSEL_Pos)                      /*!< KDF_T::CTL: LBSEL Mask                 */

#define KDF_CTL_CTXTSEL_Pos              (12)                                              /*!< KDF_T::CTL: CTXTSEL Position           */
#define KDF_CTL_CTXTSEL_Msk              (0x1ul << KDF_CTL_CTXTSEL_Pos)                    /*!< KDF_T::CTL: CTXTSEL Mask               */

#define KDF_STS_BUSY_Pos                 (0)                                               /*!< KDF_T::STS: BUSY Position              */
#define KDF_STS_BUSY_Msk                 (0x1ul << KDF_STS_BUSY_Pos)                       /*!< KDF_T::STS: BUSY Mask                  */

#define KDF_STS_HMACBUSY_Pos             (1)                                               /*!< KDF_T::STS: HMACBUSY Position          */
#define KDF_STS_HMACBUSY_Msk             (0x1ul << KDF_STS_HMACBUSY_Pos)                   /*!< KDF_T::STS: HMACBUSY Mask              */

#define KDF_STS_KSERR_Pos                (16)                                              /*!< KDF_T::STS: KSERR Position             */
#define KDF_STS_KSERR_Msk                (0x1ul << KDF_STS_KSERR_Pos)                      /*!< KDF_T::STS: KSERR Mask                 */

#define KDF_STS_NEXTERR_Pos              (17)                                              /*!< KDF_T::STS: NEXTERR Position           */
#define KDF_STS_NEXTERR_Msk              (0x1ul << KDF_STS_NEXTERR_Pos)                    /*!< KDF_T::STS: NEXTERR Mask               */

#define KDF_KLEN_KLEN_Pos                (0)                                               /*!< KDF_T::KLEN: KLEN Position             */
#define KDF_KLEN_KLEN_Msk                (0xfffful << KDF_KLEN_KLEN_Pos)                   /*!< KDF_T::KLEN: KLEN Mask                 */

#define KDF_KEYIN0_KEYIN_Pos             (0)                                               /*!< KDF_T::KEYIN0: KEYIN Position          */
#define KDF_KEYIN0_KEYIN_Msk             (0xfffffffful << KDF_KEYIN0_KEYIN_Pos)            /*!< KDF_T::KEYIN0: KEYIN Mask              */

#define KDF_KEYIN1_KEYIN_Pos             (0)                                               /*!< KDF_T::KEYIN1: KEYIN Position          */
#define KDF_KEYIN1_KEYIN_Msk             (0xfffffffful << KDF_KEYIN1_KEYIN_Pos)            /*!< KDF_T::KEYIN1: KEYIN Mask              */

#define KDF_KEYIN2_KEYIN_Pos             (0)                                               /*!< KDF_T::KEYIN2: KEYIN Position          */
#define KDF_KEYIN2_KEYIN_Msk             (0xfffffffful << KDF_KEYIN2_KEYIN_Pos)            /*!< KDF_T::KEYIN2: KEYIN Mask              */

#define KDF_KEYIN3_KEYIN_Pos             (0)                                               /*!< KDF_T::KEYIN3: KEYIN Position          */
#define KDF_KEYIN3_KEYIN_Msk             (0xfffffffful << KDF_KEYIN3_KEYIN_Pos)            /*!< KDF_T::KEYIN3: KEYIN Mask              */

#define KDF_KEYIN4_KEYIN_Pos             (0)                                               /*!< KDF_T::KEYIN4: KEYIN Position          */
#define KDF_KEYIN4_KEYIN_Msk             (0xfffffffful << KDF_KEYIN4_KEYIN_Pos)            /*!< KDF_T::KEYIN4: KEYIN Mask              */

#define KDF_KEYIN5_KEYIN_Pos             (0)                                               /*!< KDF_T::KEYIN5: KEYIN Position          */
#define KDF_KEYIN5_KEYIN_Msk             (0xfffffffful << KDF_KEYIN5_KEYIN_Pos)            /*!< KDF_T::KEYIN5: KEYIN Mask              */

#define KDF_KEYIN6_KEYIN_Pos             (0)                                               /*!< KDF_T::KEYIN6: KEYIN Position          */
#define KDF_KEYIN6_KEYIN_Msk             (0xfffffffful << KDF_KEYIN6_KEYIN_Pos)            /*!< KDF_T::KEYIN6: KEYIN Mask              */

#define KDF_KEYIN7_KEYIN_Pos             (0)                                               /*!< KDF_T::KEYIN7: KEYIN Position          */
#define KDF_KEYIN7_KEYIN_Msk             (0xfffffffful << KDF_KEYIN7_KEYIN_Pos)            /*!< KDF_T::KEYIN7: KEYIN Mask              */

#define KDF_KEYOUT0_KEYOUT_Pos           (0)                                               /*!< KDF_T::KEYOUT0: KEYOUT Position        */
#define KDF_KEYOUT0_KEYOUT_Msk           (0xfffffffful << KDF_KEYOUT0_KEYOUT_Pos)          /*!< KDF_T::KEYOUT0: KEYOUT Mask            */

#define KDF_KEYOUT1_KEYOUT_Pos           (0)                                               /*!< KDF_T::KEYOUT1: KEYOUT Position        */
#define KDF_KEYOUT1_KEYOUT_Msk           (0xfffffffful << KDF_KEYOUT1_KEYOUT_Pos)          /*!< KDF_T::KEYOUT1: KEYOUT Mask            */

#define KDF_KEYOUT2_KEYOUT_Pos           (0)                                               /*!< KDF_T::KEYOUT2: KEYOUT Position        */
#define KDF_KEYOUT2_KEYOUT_Msk           (0xfffffffful << KDF_KEYOUT2_KEYOUT_Pos)          /*!< KDF_T::KEYOUT2: KEYOUT Mask            */

