zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/kdf_reg.h
#define KDF_KEYOUT3_KEYOUT_Pos           (0)                                               /*!< KDF_T::KEYOUT3: KEYOUT Position        */
#define KDF_KEYOUT3_KEYOUT_Msk           (0xfffffffful << KDF_KEYOUT3_KEYOUT_Pos)          /*!< KDF_T::KEYOUT3: KEYOUT Mask            */

#define KDF_KEYOUT4_KEYOUT_Pos           (0)                                               /*!< KDF_T::KEYOUT4: KEYOUT Position        */
#define KDF_KEYOUT4_KEYOUT_Msk           (0xfffffffful << KDF_KEYOUT4_KEYOUT_Pos)          /*!< KDF_T::KEYOUT4: KEYOUT Mask            */

#define KDF_KEYOUT5_KEYOUT_Pos           (0)                                               /*!< KDF_T::KEYOUT5: KEYOUT Position        */
#define KDF_KEYOUT5_KEYOUT_Msk           (0xfffffffful << KDF_KEYOUT5_KEYOUT_Pos)          /*!< KDF_T::KEYOUT5: KEYOUT Mask            */

#define KDF_KEYOUT6_KEYOUT_Pos           (0)                                               /*!< KDF_T::KEYOUT6: KEYOUT Position        */
#define KDF_KEYOUT6_KEYOUT_Msk           (0xfffffffful << KDF_KEYOUT6_KEYOUT_Pos)          /*!< KDF_T::KEYOUT6: KEYOUT Mask            */

#define KDF_KEYOUT7_KEYOUT_Pos           (0)                                               /*!< KDF_T::KEYOUT7: KEYOUT Position        */
#define KDF_KEYOUT7_KEYOUT_Msk           (0xfffffffful << KDF_KEYOUT7_KEYOUT_Pos)          /*!< KDF_T::KEYOUT7: KEYOUT Mask            */

#define KDF_SALT0_SALT_Pos               (0)                                               /*!< KDF_T::SALT0: SALT Position            */
#define KDF_SALT0_SALT_Msk               (0xfffffffful << KDF_SALT0_SALT_Pos)              /*!< KDF_T::SALT0: SALT Mask                */

#define KDF_SALT1_SALT_Pos               (0)                                               /*!< KDF_T::SALT1: SALT Position            */
#define KDF_SALT1_SALT_Msk               (0xfffffffful << KDF_SALT1_SALT_Pos)              /*!< KDF_T::SALT1: SALT Mask                */

#define KDF_SALT2_SALT_Pos               (0)                                               /*!< KDF_T::SALT2: SALT Position            */
#define KDF_SALT2_SALT_Msk               (0xfffffffful << KDF_SALT2_SALT_Pos)              /*!< KDF_T::SALT2: SALT Mask                */

#define KDF_SALT3_SALT_Pos               (0)                                               /*!< KDF_T::SALT3: SALT Position            */
#define KDF_SALT3_SALT_Msk               (0xfffffffful << KDF_SALT3_SALT_Pos)              /*!< KDF_T::SALT3: SALT Mask                */

#define KDF_SALT4_SALT_Pos               (0)                                               /*!< KDF_T::SALT4: SALT Position            */
#define KDF_SALT4_SALT_Msk               (0xfffffffful << KDF_SALT4_SALT_Pos)              /*!< KDF_T::SALT4: SALT Mask                */

#define KDF_SALT5_SALT_Pos               (0)                                               /*!< KDF_T::SALT5: SALT Position            */
#define KDF_SALT5_SALT_Msk               (0xfffffffful << KDF_SALT5_SALT_Pos)              /*!< KDF_T::SALT5: SALT Mask                */

#define KDF_SALT6_SALT_Pos               (0)                                               /*!< KDF_T::SALT6: SALT Position            */
#define KDF_SALT6_SALT_Msk               (0xfffffffful << KDF_SALT6_SALT_Pos)              /*!< KDF_T::SALT6: SALT Mask                */

#define KDF_SALT7_SALT_Pos               (0)                                               /*!< KDF_T::SALT7: SALT Position            */
#define KDF_SALT7_SALT_Msk               (0xfffffffful << KDF_SALT7_SALT_Pos)              /*!< KDF_T::SALT7: SALT Mask                */

#define KDF_LABEL0_LABEL_Pos             (0)                                               /*!< KDF_T::LABEL0: LABEL Position          */
#define KDF_LABEL0_LABEL_Msk             (0xfffffffful << KDF_LABEL0_LABEL_Pos)            /*!< KDF_T::LABEL0: LABEL Mask              */

#define KDF_LABEL1_LABEL_Pos             (0)                                               /*!< KDF_T::LABEL1: LABEL Position          */
#define KDF_LABEL1_LABEL_Msk             (0xfffffffful << KDF_LABEL1_LABEL_Pos)            /*!< KDF_T::LABEL1: LABEL Mask              */

#define KDF_LABEL2_LABEL_Pos             (0)                                               /*!< KDF_T::LABEL2: LABEL Position          */
#define KDF_LABEL2_LABEL_Msk             (0xfffffffful << KDF_LABEL2_LABEL_Pos)            /*!< KDF_T::LABEL2: LABEL Mask              */

#define KDF_CTXT0_CTXT_Pos               (0)                                               /*!< KDF_T::CTXT0: CTXT Position            */
#define KDF_CTXT0_CTXT_Msk               (0xfffffffful << KDF_CTXT0_CTXT_Pos)              /*!< KDF_T::CTXT0: CTXT Mask                */

#define KDF_CTXT1_CTXT_Pos               (0)                                               /*!< KDF_T::CTXT1: CTXT Position            */
#define KDF_CTXT1_CTXT_Msk               (0xfffffffful << KDF_CTXT1_CTXT_Pos)              /*!< KDF_T::CTXT1: CTXT Mask                */

#define KDF_CTXT2_CTXT_Pos               (0)                                               /*!< KDF_T::CTXT2: CTXT Position            */
#define KDF_CTXT2_CTXT_Msk               (0xfffffffful << KDF_CTXT2_CTXT_Pos)              /*!< KDF_T::CTXT2: CTXT Mask                */

#define KDF_CTXT3_CTXT_Pos               (0)                                               /*!< KDF_T::CTXT3: CTXT Position            */
#define KDF_CTXT3_CTXT_Msk               (0xfffffffful << KDF_CTXT3_CTXT_Pos)              /*!< KDF_T::CTXT3: CTXT Mask                */

#define KDF_KSCTL_TRUST_Pos              (16)                                              /*!< KDF_T::KSCTL: TRUST Position           */
#define KDF_KSCTL_TRUST_Msk              (0x1ul << KDF_KSCTL_TRUST_Pos)                    /*!< KDF_T::KSCTL: TRUST Mask               */

#define KDF_KSCTL_PRIV_Pos               (17)                                              /*!< KDF_T::KSCTL: PRIV Position            */
#define KDF_KSCTL_PRIV_Msk               (0x1ul << KDF_KSCTL_PRIV_Pos)                     /*!< KDF_T::KSCTL: PRIV Mask                */

#define KDF_KSCTL_WDST_Pos               (21)                                              /*!< KDF_T::KSCTL: WDST Position            */
#define KDF_KSCTL_WDST_Msk               (0x1ul << KDF_KSCTL_WDST_Pos)                     /*!< KDF_T::KSCTL: WDST Mask                */

#define KDF_KSCTL_WSDST_Pos              (22)                                              /*!< KDF_T::KSCTL: WSDST Position           */
#define KDF_KSCTL_WSDST_Msk              (0x3ul << KDF_KSCTL_WSDST_Pos)                    /*!< KDF_T::KSCTL: WSDST Mask               */

#define KDF_KSCTL_OWNER_Pos              (24)                                              /*!< KDF_T::KSCTL: OWNER Position           */
#define KDF_KSCTL_OWNER_Msk              (0x7ul << KDF_KSCTL_OWNER_Pos)                    /*!< KDF_T::KSCTL: OWNER Mask               */

#define KDF_KSSTS_NUM_Pos                (0)                                               /*!< KDF_T::KSSTS: NUM Position             */
#define KDF_KSSTS_NUM_Msk                (0x1ful << KDF_KSSTS_NUM_Pos)                     /*!< KDF_T::KSSTS: NUM Mask                 */

#define KDF_KSSIZE_SIZE_Pos              (0)                                               /*!< KDF_T::KSSIZE: SIZE Position           */
#define KDF_KSSIZE_SIZE_Msk              (0xful << KDF_KSSIZE_SIZE_Pos)                    /*!< KDF_T::KSSIZE: SIZE Mask               */

/** @} KDF_CONST */
/** @} end of KDF register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __KDF_REG_H__ */
